function toCyrillic(text) {
    const map = {
        "ya": "я", "Yo": "Ё", "yo": "ё", "Ye": "Е", "ye": "е", "Yu": "Ю", "yu": "ю",
        "Ch": "Ч", "ch": "ч", "Sh": "Ш", "sh": "ш", "O‘": "Ў", "o‘": "ў",
        "G‘": "Ғ", "g‘": "ғ", "Ng": "Нг", "ng": "нг",
        "A": "А", "B": "Б", "C": "Ц", "D": "Д", "E": "Э", "F": "Ф", "G": "Г",
        "H": "Ҳ", "I": "И", "J": "Ж", "K": "К", "L": "Л", "M": "М", "N": "Н",
        "O": "О", "P": "П", "Q": "Қ", "R": "Р", "S": "С", "T": "Т", "U": "У",
        "V": "В", "X": "Х", "Y": "Й", "Z": "З",
        "a": "а", "b": "б", "c": "ц", "d": "д", "e": "э", "f": "ф", "g": "г",
        "h": "ҳ", "i": "и", "j": "ж", "k": "к", "l": "л", "m": "м", "n": "н",
        "o": "о", "p": "п", "q": "қ", "r": "р", "s": "с", "t": "т", "u": "у",
        "v": "в", "x": "х", "y": "й", "z": "з", "'": "ъ"
    };

    return text.replace(/Sh|CH|Ch|sh|ch|G‘|g‘|O‘|o‘|Ng|ng|Yo|yo|Ye|ye|Yu|yu|Ya|ya|[A-Za-z']/g, match => map[match] || match);
}

module.exports = {
    toCyrillic
};